module  {
  func @tpu_func(%arg0: tensor<1x3x416x416xf32>) -> (tensor<1x2535x1x4xf32>, tensor<1x2535x80xf32>) attributes {chipname = "cv183x"} {
    %0 = "tpu.weight_file"() {filename = "yolov4-tiny_5_39426fd72048.npz"} : () -> memref<10xf32>
    %1 = "tpu.input"(%arg0) {name = "input", preprocess = {color_order = "bgr", data_format = "nchw", input_scale = 1.000000e+00 : f32, mean = [0.000000e+00 : f32, 0.000000e+00 : f32, 0.000000e+00 : f32], raw_scale = 2.550000e+02 : f32, std = [1.000000e+00 : f32, 1.000000e+00 : f32, 1.000000e+00 : f32]}, quant = {is_asymmetric = false, is_perchannel = false, mode = "NONE", param_type = "THRESHOLD", threshold_max = 2.641290e+00 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x3x416x416xf32>) -> tensor<1x3x416x416xf32>
    %2 = "tpu.none"() : () -> none
    %3 = "tpu.load_weight"(%0) {name = "120_BatchNormalization_merge_scale_0_51.264450_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<32x3x3x3xf32>
    %4 = "tpu.load_weight"(%0) {name = "120_BatchNormalization_merge_scale_1_51.264450_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<32xf32>
    %5 = "tpu.load_weight"(%0) {name = "120_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %6 = "tpu.load_weight"(%0) {name = "120_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %7 = "tpu.quant"(%1) {from = "NONE", name = "input_quant", threshold = 2.641290e+00 : f32, to = "INT8", zero_point = 0 : i32} : (tensor<1x3x416x416xf32>) -> tensor<1x3x416x416xi8>
    %8 = "tpu.conv_2d"(%7, %3, %4, %2, %2, %5, %6) {name = "120_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 2 : i32, stride_w = 2 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 51.2644501 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x3x416x416xi8>, tensor<32x3x3x3xf32>, tensor<32xf32>, none, none, tensor<32xf32>, tensor<32xf32>) -> tensor<1x32x208x208xsi8>
    %9 = "tpu.none"() : () -> none
    %10 = "tpu.load_weight"(%0) {name = "121_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %11 = "tpu.load_weight"(%0) {name = "121_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %12 = "tpu.load_weight"(%0) {name = "121_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %13 = "tpu.load_weight"(%0) {name = "121_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %14 = "tpu.leaky_relu"(%8, %9, %9, %9, %9, %10, %11, %12, %13) {name = "121_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 51.2644501 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x208x208xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x32x208x208xsi8>
    %15 = "tpu.none"() : () -> none
    %16 = "tpu.load_weight"(%0) {name = "123_BatchNormalization_merge_scale_0_69.456528_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<64x32x3x3xf32>
    %17 = "tpu.load_weight"(%0) {name = "123_BatchNormalization_merge_scale_1_69.456528_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<64xf32>
    %18 = "tpu.load_weight"(%0) {name = "123_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %19 = "tpu.load_weight"(%0) {name = "123_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %20 = "tpu.conv_2d"(%14, %16, %17, %15, %15, %18, %19) {name = "123_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 2 : i32, stride_w = 2 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 69.4565277 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x208x208xsi8>, tensor<64x32x3x3xf32>, tensor<64xf32>, none, none, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x104x104xsi8>
    %21 = "tpu.none"() : () -> none
    %22 = "tpu.load_weight"(%0) {name = "124_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %23 = "tpu.load_weight"(%0) {name = "124_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %24 = "tpu.load_weight"(%0) {name = "124_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %25 = "tpu.load_weight"(%0) {name = "124_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %26 = "tpu.leaky_relu"(%20, %21, %21, %21, %21, %22, %23, %24, %25) {name = "124_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 69.4565277 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x64x104x104xsi8>
    %27 = "tpu.none"() : () -> none
    %28 = "tpu.load_weight"(%0) {name = "126_BatchNormalization_merge_scale_0_39.166340_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<64x64x3x3xf32>
    %29 = "tpu.load_weight"(%0) {name = "126_BatchNormalization_merge_scale_1_39.166340_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<64xf32>
    %30 = "tpu.load_weight"(%0) {name = "126_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %31 = "tpu.load_weight"(%0) {name = "126_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %32 = "tpu.conv_2d"(%26, %28, %29, %27, %27, %30, %31) {name = "126_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 39.1663399 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, tensor<64x64x3x3xf32>, tensor<64xf32>, none, none, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x104x104xsi8>
    %33 = "tpu.none"() : () -> none
    %34 = "tpu.load_weight"(%0) {name = "127_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %35 = "tpu.load_weight"(%0) {name = "127_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %36 = "tpu.load_weight"(%0) {name = "127_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %37 = "tpu.load_weight"(%0) {name = "127_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %38 = "tpu.leaky_relu"(%32, %33, %33, %33, %33, %34, %35, %36, %37) {name = "127_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 39.1663399 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x64x104x104xsi8>
    %39 = "tpu.crop"(%38) {crop_offset = [0 : i32, 32 : i32, 0 : i32, 0 : i32], crop_shape = [1 : i32, 32 : i32, 104 : i32, 104 : i32], name = "146_Slice", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 39.1663399 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>) -> tensor<1x32x104x104xsi8>
    %40 = "tpu.none"() : () -> none
    %41 = "tpu.load_weight"(%0) {name = "148_BatchNormalization_merge_scale_0_51.325260_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<32x32x3x3xf32>
    %42 = "tpu.load_weight"(%0) {name = "148_BatchNormalization_merge_scale_1_51.325260_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<32xf32>
    %43 = "tpu.load_weight"(%0) {name = "148_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %44 = "tpu.load_weight"(%0) {name = "148_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %45 = "tpu.conv_2d"(%39, %41, %42, %40, %40, %43, %44) {name = "148_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 51.3252602 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x104x104xsi8>, tensor<32x32x3x3xf32>, tensor<32xf32>, none, none, tensor<32xf32>, tensor<32xf32>) -> tensor<1x32x104x104xsi8>
    %46 = "tpu.none"() : () -> none
    %47 = "tpu.load_weight"(%0) {name = "149_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %48 = "tpu.load_weight"(%0) {name = "149_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %49 = "tpu.load_weight"(%0) {name = "149_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %50 = "tpu.load_weight"(%0) {name = "149_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %51 = "tpu.leaky_relu"(%45, %46, %46, %46, %46, %47, %48, %49, %50) {name = "149_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 51.3252602 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x104x104xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x32x104x104xsi8>
    %52 = "tpu.none"() : () -> none
    %53 = "tpu.load_weight"(%0) {name = "151_BatchNormalization_merge_scale_0_49.287769_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<32x32x3x3xf32>
    %54 = "tpu.load_weight"(%0) {name = "151_BatchNormalization_merge_scale_1_49.287769_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<32xf32>
    %55 = "tpu.load_weight"(%0) {name = "151_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %56 = "tpu.load_weight"(%0) {name = "151_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<32xf32>
    %57 = "tpu.conv_2d"(%51, %53, %54, %52, %52, %55, %56) {name = "151_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 49.2877693 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x104x104xsi8>, tensor<32x32x3x3xf32>, tensor<32xf32>, none, none, tensor<32xf32>, tensor<32xf32>) -> tensor<1x32x104x104xsi8>
    %58 = "tpu.none"() : () -> none
    %59 = "tpu.load_weight"(%0) {name = "152_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %60 = "tpu.load_weight"(%0) {name = "152_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %61 = "tpu.load_weight"(%0) {name = "152_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %62 = "tpu.load_weight"(%0) {name = "152_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %63 = "tpu.leaky_relu"(%57, %58, %58, %58, %58, %59, %60, %61, %62) {name = "152_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 49.2877693 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x104x104xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x32x104x104xsi8>
    %64 = "tpu.none"() : () -> none
    %65 = "tpu.load_weight"(%0) {name = "153_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %66 = "tpu.load_weight"(%0) {name = "153_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %67 = "tpu.concat"(%63, %51, %64, %64, %65, %66) {axis = 1 : i32, name = "153_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 51.3252602 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x32x104x104xsi8>, tensor<1x32x104x104xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x64x104x104xsi8>
    %68 = "tpu.none"() : () -> none
    %69 = "tpu.load_weight"(%0) {name = "155_BatchNormalization_merge_scale_0_23.835270_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<64x64x1x1xf32>
    %70 = "tpu.load_weight"(%0) {name = "155_BatchNormalization_merge_scale_1_23.835270_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<64xf32>
    %71 = "tpu.load_weight"(%0) {name = "155_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %72 = "tpu.load_weight"(%0) {name = "155_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %73 = "tpu.conv_2d"(%67, %69, %70, %68, %68, %71, %72) {name = "155_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "VALID", padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 23.8352699 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, tensor<64x64x1x1xf32>, tensor<64xf32>, none, none, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x104x104xsi8>
    %74 = "tpu.none"() : () -> none
    %75 = "tpu.load_weight"(%0) {name = "156_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %76 = "tpu.load_weight"(%0) {name = "156_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %77 = "tpu.load_weight"(%0) {name = "156_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %78 = "tpu.load_weight"(%0) {name = "156_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %79 = "tpu.leaky_relu"(%73, %74, %74, %74, %74, %75, %76, %77, %78) {name = "156_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 23.8352699 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x64x104x104xsi8>
    %80 = "tpu.none"() : () -> none
    %81 = "tpu.load_weight"(%0) {name = "157_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %82 = "tpu.load_weight"(%0) {name = "157_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %83 = "tpu.concat"(%38, %79, %80, %80, %81, %82) {axis = 1 : i32, name = "157_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 78.3326797 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x104x104xsi8>, tensor<1x64x104x104xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x128x104x104xsi8>
    %84 = "tpu.pool_max_2d"(%83) {name = "158_MaxPool", param = {count_include_pad = false, do_relu = false, kernel_h = 2 : i32, kernel_w = 2 : i32, pad_value = 0 : i32, padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 2 : i32, stride_w = 2 : i32}, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 78.3326797 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x104x104xsi8>) -> tensor<1x128x52x52xsi8>
    %85 = "tpu.none"() : () -> none
    %86 = "tpu.load_weight"(%0) {name = "160_BatchNormalization_merge_scale_0_20.640499_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<128x128x3x3xf32>
    %87 = "tpu.load_weight"(%0) {name = "160_BatchNormalization_merge_scale_1_20.640499_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<128xf32>
    %88 = "tpu.load_weight"(%0) {name = "160_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %89 = "tpu.load_weight"(%0) {name = "160_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %90 = "tpu.conv_2d"(%84, %86, %87, %85, %85, %88, %89) {name = "160_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 2.064050e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>, tensor<128x128x3x3xf32>, tensor<128xf32>, none, none, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x52x52xsi8>
    %91 = "tpu.none"() : () -> none
    %92 = "tpu.load_weight"(%0) {name = "161_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %93 = "tpu.load_weight"(%0) {name = "161_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %94 = "tpu.load_weight"(%0) {name = "161_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %95 = "tpu.load_weight"(%0) {name = "161_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %96 = "tpu.leaky_relu"(%90, %91, %91, %91, %91, %92, %93, %94, %95) {name = "161_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 2.064050e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x128x52x52xsi8>
    %97 = "tpu.crop"(%96) {crop_offset = [0 : i32, 64 : i32, 0 : i32, 0 : i32], crop_shape = [1 : i32, 64 : i32, 52 : i32, 52 : i32], name = "180_Slice", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 2.064050e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>) -> tensor<1x64x52x52xsi8>
    %98 = "tpu.none"() : () -> none
    %99 = "tpu.load_weight"(%0) {name = "182_BatchNormalization_merge_scale_0_21.632450_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<64x64x3x3xf32>
    %100 = "tpu.load_weight"(%0) {name = "182_BatchNormalization_merge_scale_1_21.632450_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<64xf32>
    %101 = "tpu.load_weight"(%0) {name = "182_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %102 = "tpu.load_weight"(%0) {name = "182_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %103 = "tpu.conv_2d"(%97, %99, %100, %98, %98, %101, %102) {name = "182_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 21.6324501 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x52x52xsi8>, tensor<64x64x3x3xf32>, tensor<64xf32>, none, none, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x52x52xsi8>
    %104 = "tpu.none"() : () -> none
    %105 = "tpu.load_weight"(%0) {name = "183_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %106 = "tpu.load_weight"(%0) {name = "183_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %107 = "tpu.load_weight"(%0) {name = "183_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %108 = "tpu.load_weight"(%0) {name = "183_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %109 = "tpu.leaky_relu"(%103, %104, %104, %104, %104, %105, %106, %107, %108) {name = "183_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 21.6324501 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x52x52xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x64x52x52xsi8>
    %110 = "tpu.none"() : () -> none
    %111 = "tpu.load_weight"(%0) {name = "185_BatchNormalization_merge_scale_0_29.885639_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<64x64x3x3xf32>
    %112 = "tpu.load_weight"(%0) {name = "185_BatchNormalization_merge_scale_1_29.885639_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<64xf32>
    %113 = "tpu.load_weight"(%0) {name = "185_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %114 = "tpu.load_weight"(%0) {name = "185_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<64xf32>
    %115 = "tpu.conv_2d"(%109, %111, %112, %110, %110, %113, %114) {name = "185_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 29.8856392 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x52x52xsi8>, tensor<64x64x3x3xf32>, tensor<64xf32>, none, none, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x52x52xsi8>
    %116 = "tpu.none"() : () -> none
    %117 = "tpu.load_weight"(%0) {name = "186_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %118 = "tpu.load_weight"(%0) {name = "186_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %119 = "tpu.load_weight"(%0) {name = "186_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %120 = "tpu.load_weight"(%0) {name = "186_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %121 = "tpu.leaky_relu"(%115, %116, %116, %116, %116, %117, %118, %119, %120) {name = "186_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 29.8856392 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x52x52xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x64x52x52xsi8>
    %122 = "tpu.none"() : () -> none
    %123 = "tpu.load_weight"(%0) {name = "187_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %124 = "tpu.load_weight"(%0) {name = "187_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %125 = "tpu.concat"(%121, %109, %122, %122, %123, %124) {axis = 1 : i32, name = "187_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 2.490470e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x64x52x52xsi8>, tensor<1x64x52x52xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x128x52x52xsi8>
    %126 = "tpu.none"() : () -> none
    %127 = "tpu.load_weight"(%0) {name = "189_BatchNormalization_merge_scale_0_19.022249_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<128x128x1x1xf32>
    %128 = "tpu.load_weight"(%0) {name = "189_BatchNormalization_merge_scale_1_19.022249_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<128xf32>
    %129 = "tpu.load_weight"(%0) {name = "189_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %130 = "tpu.load_weight"(%0) {name = "189_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %131 = "tpu.conv_2d"(%125, %127, %128, %126, %126, %129, %130) {name = "189_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "VALID", padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 19.0222492 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>, tensor<128x128x1x1xf32>, tensor<128xf32>, none, none, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x52x52xsi8>
    %132 = "tpu.none"() : () -> none
    %133 = "tpu.load_weight"(%0) {name = "190_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %134 = "tpu.load_weight"(%0) {name = "190_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %135 = "tpu.load_weight"(%0) {name = "190_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %136 = "tpu.load_weight"(%0) {name = "190_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %137 = "tpu.leaky_relu"(%131, %132, %132, %132, %132, %133, %134, %135, %136) {name = "190_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 19.0222492 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x128x52x52xsi8>
    %138 = "tpu.none"() : () -> none
    %139 = "tpu.load_weight"(%0) {name = "191_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %140 = "tpu.load_weight"(%0) {name = "191_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %141 = "tpu.concat"(%96, %137, %138, %138, %139, %140) {axis = 1 : i32, name = "191_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 61.6840401 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x52x52xsi8>, tensor<1x128x52x52xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x256x52x52xsi8>
    %142 = "tpu.pool_max_2d"(%141) {name = "192_MaxPool", param = {count_include_pad = false, do_relu = false, kernel_h = 2 : i32, kernel_w = 2 : i32, pad_value = 0 : i32, padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 2 : i32, stride_w = 2 : i32}, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 61.6840401 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x52x52xsi8>) -> tensor<1x256x26x26xsi8>
    %143 = "tpu.none"() : () -> none
    %144 = "tpu.load_weight"(%0) {name = "194_BatchNormalization_merge_scale_0_13.216900_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<256x256x3x3xf32>
    %145 = "tpu.load_weight"(%0) {name = "194_BatchNormalization_merge_scale_1_13.216900_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<256xf32>
    %146 = "tpu.load_weight"(%0) {name = "194_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %147 = "tpu.load_weight"(%0) {name = "194_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %148 = "tpu.conv_2d"(%142, %144, %145, %143, %143, %146, %147) {name = "194_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 1.321690e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>, tensor<256x256x3x3xf32>, tensor<256xf32>, none, none, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x26x26xsi8>
    %149 = "tpu.none"() : () -> none
    %150 = "tpu.load_weight"(%0) {name = "195_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %151 = "tpu.load_weight"(%0) {name = "195_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %152 = "tpu.load_weight"(%0) {name = "195_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %153 = "tpu.load_weight"(%0) {name = "195_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %154 = "tpu.leaky_relu"(%148, %149, %149, %149, %149, %150, %151, %152, %153) {name = "195_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 1.321690e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x256x26x26xsi8>
    %155 = "tpu.crop"(%154) {crop_offset = [0 : i32, 128 : i32, 0 : i32, 0 : i32], crop_shape = [1 : i32, 128 : i32, 26 : i32, 26 : i32], name = "214_Slice", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 1.321690e+01 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>) -> tensor<1x128x26x26xsi8>
    %156 = "tpu.none"() : () -> none
    %157 = "tpu.load_weight"(%0) {name = "216_BatchNormalization_merge_scale_0_17.478769_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<128x128x3x3xf32>
    %158 = "tpu.load_weight"(%0) {name = "216_BatchNormalization_merge_scale_1_17.478769_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<128xf32>
    %159 = "tpu.load_weight"(%0) {name = "216_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %160 = "tpu.load_weight"(%0) {name = "216_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %161 = "tpu.conv_2d"(%155, %157, %158, %156, %156, %159, %160) {name = "216_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 17.4787693 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x26x26xsi8>, tensor<128x128x3x3xf32>, tensor<128xf32>, none, none, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x26x26xsi8>
    %162 = "tpu.none"() : () -> none
    %163 = "tpu.load_weight"(%0) {name = "217_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %164 = "tpu.load_weight"(%0) {name = "217_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %165 = "tpu.load_weight"(%0) {name = "217_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %166 = "tpu.load_weight"(%0) {name = "217_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %167 = "tpu.leaky_relu"(%161, %162, %162, %162, %162, %163, %164, %165, %166) {name = "217_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 17.4787693 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x26x26xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x128x26x26xsi8>
    %168 = "tpu.none"() : () -> none
    %169 = "tpu.load_weight"(%0) {name = "219_BatchNormalization_merge_scale_0_19.259010_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<128x128x3x3xf32>
    %170 = "tpu.load_weight"(%0) {name = "219_BatchNormalization_merge_scale_1_19.259010_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<128xf32>
    %171 = "tpu.load_weight"(%0) {name = "219_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %172 = "tpu.load_weight"(%0) {name = "219_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<128xf32>
    %173 = "tpu.conv_2d"(%167, %169, %170, %168, %168, %171, %172) {name = "219_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 19.2590103 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x26x26xsi8>, tensor<128x128x3x3xf32>, tensor<128xf32>, none, none, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x26x26xsi8>
    %174 = "tpu.none"() : () -> none
    %175 = "tpu.load_weight"(%0) {name = "220_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %176 = "tpu.load_weight"(%0) {name = "220_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %177 = "tpu.load_weight"(%0) {name = "220_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %178 = "tpu.load_weight"(%0) {name = "220_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %179 = "tpu.leaky_relu"(%173, %174, %174, %174, %174, %175, %176, %177, %178) {name = "220_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 19.2590103 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x26x26xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x128x26x26xsi8>
    %180 = "tpu.none"() : () -> none
    %181 = "tpu.load_weight"(%0) {name = "221_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %182 = "tpu.load_weight"(%0) {name = "221_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %183 = "tpu.concat"(%179, %167, %180, %180, %181, %182) {axis = 1 : i32, name = "221_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 15.4072104 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x128x26x26xsi8>, tensor<1x128x26x26xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x256x26x26xsi8>
    %184 = "tpu.none"() : () -> none
    %185 = "tpu.load_weight"(%0) {name = "223_BatchNormalization_merge_scale_0_11.466220_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<256x256x1x1xf32>
    %186 = "tpu.load_weight"(%0) {name = "223_BatchNormalization_merge_scale_1_11.466220_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<256xf32>
    %187 = "tpu.load_weight"(%0) {name = "223_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %188 = "tpu.load_weight"(%0) {name = "223_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %189 = "tpu.conv_2d"(%183, %185, %186, %184, %184, %187, %188) {name = "223_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "VALID", padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 11.4662199 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>, tensor<256x256x1x1xf32>, tensor<256xf32>, none, none, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x26x26xsi8>
    %190 = "tpu.none"() : () -> none
    %191 = "tpu.load_weight"(%0) {name = "224_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %192 = "tpu.load_weight"(%0) {name = "224_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %193 = "tpu.load_weight"(%0) {name = "224_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %194 = "tpu.load_weight"(%0) {name = "224_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %195 = "tpu.leaky_relu"(%189, %190, %190, %190, %190, %191, %192, %193, %194) {name = "224_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 11.4662199 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x256x26x26xsi8>
    %196 = "tpu.none"() : () -> none
    %197 = "tpu.load_weight"(%0) {name = "225_Concat_rshift", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %198 = "tpu.load_weight"(%0) {name = "225_Concat_multiplier", storage = "NONE"} : (memref<10xf32>) -> tensor<2xf32>
    %199 = "tpu.concat"(%154, %195, %196, %196, %197, %198) {axis = 1 : i32, name = "225_Concat", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 29.5367508 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x26x26xsi8>, tensor<1x256x26x26xsi8>, none, none, tensor<1xf32>, tensor<2xf32>) -> tensor<1x512x26x26xsi8>
    %200 = "tpu.pool_max_2d"(%199) {name = "226_MaxPool", param = {count_include_pad = false, do_relu = false, kernel_h = 2 : i32, kernel_w = 2 : i32, pad_value = 0 : i32, padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 2 : i32, stride_w = 2 : i32}, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 29.5367508 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x26x26xsi8>) -> tensor<1x512x13x13xsi8>
    %201 = "tpu.none"() : () -> none
    %202 = "tpu.load_weight"(%0) {name = "228_BatchNormalization_merge_scale_0_16.132780_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<512x512x3x3xf32>
    %203 = "tpu.load_weight"(%0) {name = "228_BatchNormalization_merge_scale_1_16.132780_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<512xf32>
    %204 = "tpu.load_weight"(%0) {name = "228_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<512xf32>
    %205 = "tpu.load_weight"(%0) {name = "228_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<512xf32>
    %206 = "tpu.conv_2d"(%200, %202, %203, %201, %201, %204, %205) {name = "228_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 16.1327801 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x13x13xsi8>, tensor<512x512x3x3xf32>, tensor<512xf32>, none, none, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x13x13xsi8>
    %207 = "tpu.none"() : () -> none
    %208 = "tpu.load_weight"(%0) {name = "229_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %209 = "tpu.load_weight"(%0) {name = "229_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %210 = "tpu.load_weight"(%0) {name = "229_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %211 = "tpu.load_weight"(%0) {name = "229_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %212 = "tpu.leaky_relu"(%206, %207, %207, %207, %207, %208, %209, %210, %211) {name = "229_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 16.1327801 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x13x13xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x512x13x13xsi8>
    %213 = "tpu.none"() : () -> none
    %214 = "tpu.load_weight"(%0) {name = "231_BatchNormalization_merge_scale_0_20.339689_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<256x512x1x1xf32>
    %215 = "tpu.load_weight"(%0) {name = "231_BatchNormalization_merge_scale_1_20.339689_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<256xf32>
    %216 = "tpu.load_weight"(%0) {name = "231_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %217 = "tpu.load_weight"(%0) {name = "231_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<256xf32>
    %218 = "tpu.conv_2d"(%212, %214, %215, %213, %213, %216, %217) {name = "231_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "VALID", padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 20.3396893 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x13x13xsi8>, tensor<256x512x1x1xf32>, tensor<256xf32>, none, none, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x13x13xsi8>
    %219 = "tpu.none"() : () -> none
    %220 = "tpu.load_weight"(%0) {name = "232_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %221 = "tpu.load_weight"(%0) {name = "232_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %222 = "tpu.load_weight"(%0) {name = "232_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %223 = "tpu.load_weight"(%0) {name = "232_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %224 = "tpu.leaky_relu"(%218, %219, %219, %219, %219, %220, %221, %222, %223) {name = "232_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 20.3396893 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x13x13xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x256x13x13xsi8>
    %225 = "tpu.none"() : () -> none
    %226 = "tpu.load_weight"(%0) {name = "234_BatchNormalization_merge_scale_0_28.319771_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<512x256x3x3xf32>
    %227 = "tpu.load_weight"(%0) {name = "234_BatchNormalization_merge_scale_1_28.319771_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<512xf32>
    %228 = "tpu.load_weight"(%0) {name = "234_BatchNormalization_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<512xf32>
    %229 = "tpu.load_weight"(%0) {name = "234_BatchNormalization_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<512xf32>
    %230 = "tpu.conv_2d"(%224, %226, %227, %225, %225, %228, %229) {name = "234_BatchNormalization", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "SAME", padding_b = 1 : i32, padding_l = 1 : i32, padding_r = 1 : i32, padding_t = 1 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 28.3197708 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x256x13x13xsi8>, tensor<512x256x3x3xf32>, tensor<512xf32>, none, none, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x13x13xsi8>
    %231 = "tpu.none"() : () -> none
    %232 = "tpu.load_weight"(%0) {name = "235_LeakyRelu_rshift_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %233 = "tpu.load_weight"(%0) {name = "235_LeakyRelu_multiplier_pos", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %234 = "tpu.load_weight"(%0) {name = "235_LeakyRelu_rshift_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %235 = "tpu.load_weight"(%0) {name = "235_LeakyRelu_multiplier_neg", storage = "NONE"} : (memref<10xf32>) -> tensor<1xf32>
    %236 = "tpu.leaky_relu"(%230, %231, %231, %231, %231, %232, %233, %234, %235) {name = "235_LeakyRelu", negative_slope = 1.000000e-01 : f32, quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "RSHIFT_AND_M_I8", threshold_max = 28.3197708 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x13x13xsi8>, none, none, none, none, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<1x512x13x13xsi8>
    %237 = "tpu.load_weight"(%0) {name = "models.29.conv18.weight_4.196190_quant", storage = "INT8"} : (memref<10xf32>) -> tensor<255x512x1x1xf32>
    %238 = "tpu.load_weight"(%0) {name = "models.29.conv18.bias_4.196190_quant", storage = "INT32"} : (memref<10xf32>) -> tensor<255xf32>
    %239 = "tpu.none"() : () -> none
    %240 = "tpu.load_weight"(%0) {name = "236_Conv_rshift", storage = "UINT32"} : (memref<10xf32>) -> tensor<255xf32>
    %241 = "tpu.load_weight"(%0) {name = "236_Conv_multiplier", storage = "UINT32"} : (memref<10xf32>) -> tensor<255xf32>
    %242 = "tpu.conv_2d"(%236, %237, %238, %239, %239, %240, %241) {name = "236_Conv", param = {dilation_h = 1 : i32, dilation_w = 1 : i32, do_relu = false, group = 1 : i32, ins = [], is_dw = false, pad_value = 0 : i32, padding = "VALID", padding_b = 0 : i32, padding_l = 0 : i32, padding_r = 0 : i32, padding_t = 0 : i32, stride_h = 1 : i32, stride_w = 1 : i32, with_bias = true}, quant = {is_asymmetric = false, is_perchannel = true, mode = "INT8", param_type = "RSHIFT_AND_M_I32", threshold_max = 4.196190e+00 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x512x13x13xsi8>, tensor<255x512x1x1xf32>, tensor<255xf32>, none, none, tensor<255xf32>, tensor<255xf32>) -> tensor<1x255x13x13xsi8>
    %243 = "tpu.crop"(%242) {crop_offset = [0 : i32, 0 : i32, 0 : i32, 0 : i32], crop_shape = [1 : i32, 2 : i32, 13 : i32, 13 : i32], name = "241_Slice", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 4.196190e+00 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x255x13x13xsi8>) -> tensor<1x2x13x13xsi8>
    %244 = "tpu.crop"(%242) {crop_offset = [0 : i32, 2 : i32, 0 : i32, 0 : i32], crop_shape = [1 : i32, 2 : i32, 13 : i32, 13 : i32], name = "246_Slice", quant = {is_asymmetric = false, is_perchannel = false, mode = "INT8", param_type = "NONE", threshold_max = 1.673770e+00 : f32, threshold_min = 0.000000e+00 : f32, zero_point = 0 : i32}} : (tensor<1x255x13x13xsi8>) -> tensor<1x2x13x13xsi8>
